//2-10位中文名字
export const chineseName = /^[\u4e00-\u9fa5]{2,10}$/;
//身份证号
export const IDCard = /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[xX])$/;

//手机号码
export const phone = /^1(3[0-9]|4[01456879]|5[0-35-9]|6[2567]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/;

//邮箱
export const mail = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

//银行卡号(不太好用)
export const bankCount = /^([1-9]{1})(\d{14}|\d{18})$/;

//1-9位数字(非0开头)
export const nineNum = /^\d{1,9}$/;

//备注 中文、英文、数字和字符 (2-100)位  
export const message = /^[\u4E00-\u9FA5A-Za-z0-9_]{2,100}$/;

//1-100之间的正整数/^([1-9]|[1-9][0-9]|100)$/